In [1]:
#MODULES & BUILT-IN MODULES

In [5]:
#Write a program that uses the math module to check whether a number is a perfect square.
import math

num = 36
root = math.sqrt(num)

if root.is_integer():
    print("Perfect square")
else:
    print("Not a perfect square")

Perfect square

In [9]:
#Generate a random password of 6 characters using random.
import random

chars = "abcdefghijklmnopqrstuvwxyz0123456789"
password = ""

for i in range(6):
    password += random.choice(chars)

print(password)

v6311m

In [11]:
#dir()
#Print only function names from the math module.
import math

functions = [f for f in dir(math) if not f.startswith("_")]
print(functions)

['acos', 'acosh', 'asin', 'asinh', 'atan', 'atan2', 'atanh', 'cbrt', 'ceil', 'comb', 'copysign', 'cos', 'cosh', 'degrees', 'dist', 'e', 'erf', 'erfc', 'exp', 'exp2', 'expm1', 'fabs', 'factorial', 'floor', 'fmod', 'frexp', 'fsum', 'gamma', 'gcd', 'hypot', 'inf', 'isclose', 'isfinite', 'isinf', 'isnan', 'isqrt', 'lcm', 'ldexp', 'lgamma', 'log', 'log10', 'log1p', 'log2', 'modf', 'nan', 'nextafter', 'perm', 'pi', 'pow', 'prod', 'radians', 'remainder', 'sin', 'sinh', 'sqrt', 'sumprod', 'tan', 'tanh', 'tau', 'trunc', 'ulp']

In [17]:
#help()
import math

if "log" in dir(math):
    help(math.log)

Help on built-in function log in module math:

log(...)
    log(x, [base=math.e])
    Return the logarithm of x to the given base.

    If the base is not specified, returns the natural logarithm (base e) of x.

In [23]:
#DATETIME MODULE
#Calculate how many days are left until New Year.
from datetime import date

today = date.today()
new_year = date(today.year + 1, 1, 1)

print((new_year - today).days)

13

In [27]:
#Display current time in HH:MM format only.
from datetime import datetime

now = datetime.now()
print(now.strftime("%H:%M")) #strftime() formats output

00:09

In [29]:
#List only .txt files from a directory.
import os

files = os.listdir()
txt_files = [f for f in files if f.endswith(".txt")]

print(txt_files)

[]

In [31]:
#Rename a file if it exists.
import os

if os.path.exists("old.txt"):
    os.rename("old.txt", "new.txt")

In [35]:
#Print custom error message and exit program if Python version < 3.
import sys

if sys.version_info.major < 3:
    sys.exit("Python 3 required")

print("Version OK")

Version OK

In [37]:
#Print all import paths line by line.
import sys

for path in sys.path:
    print(path)

C:\Users\thanu
C:\Users\thanu\anaconda3\python312.zip
C:\Users\thanu\anaconda3\DLLs
C:\Users\thanu\anaconda3\Lib
C:\Users\thanu\anaconda3

C:\Users\thanu\anaconda3\Lib\site-packages
C:\Users\thanu\anaconda3\Lib\site-packages\win32
C:\Users\thanu\anaconda3\Lib\site-packages\win32\lib
C:\Users\thanu\anaconda3\Lib\site-packages\Pythonwin

In [70]:
#Create a custom module to check even or odd.
def is_even(num):
    return num % 2 == 0

In [74]:
#Handle multiple exceptions in one program.
try:
    num = int(input("Enter number: "))
    print(10 / num)
except ValueError:
    print("Invalid input")
except ZeroDivisionError:
    print("Cannot divide by zero")

Enter number:  5

2.0

In [54]:
try:
    x = int(input("Enter number: "))
except:
    print("Error")
else:
    print("Square:", x * x)

Enter number:  5

Square: 25

In [58]:
#Ensure cleanup using finally.
try:
    f = open("data.txt", "w")
    f.write("Hello")
finally:
    f.close()
#File closes even if error occurs

In [60]:
#Insert multiple rows using a loop.
import sqlite3

conn = sqlite3.connect("marks.db")
conn.execute("create table if not exists student(id int, marks int)")

data = [(1, 80), (2, 90), (3, 70)]

for row in data:
    conn.execute("insert into student values (?, ?)", row)

conn.commit()
conn.close()

In [64]:
#Fetch only students with marks > 75.
import sqlite3

conn = sqlite3.connect("marks.db")
cursor = conn.execute("select * from student where marks > 75")

for row in cursor:
    print(row)

conn.close()

(1, 80)
(2, 90)

In [66]:
#Use exception handling while inserting data into database.
import sqlite3

try:
    conn = sqlite3.connect("test.db")
    conn.execute("insert into student values(1,'John')")
    conn.commit()
except:
    print("Database error")
finally:
    conn.close()

Database error

In [76]:
#DATA MANIPULATION (PANDAS)

In [78]:
#Sample data
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "Alice", "Bob"],
    "Subject": ["Math", "Math", "Science", "Science", "Science"],
    "Marks": [85, 90, 78, 88, 95]
}

df = pd.DataFrame(data)

In [80]:
#How do you filter rows where Marks are greater than 85?
df[df["Marks"] > 85]

    Name  Subject  Marks
1    Bob     Math     90
3  Alice  Science     88
4    Bob  Science     95

In [82]:
#How do you display only records where Subject is "Science"?
df[df["Subject"] == "Science"]

      Name  Subject  Marks
2  Charlie  Science     78
3    Alice  Science     88
4      Bob  Science     95

In [84]:
#How do you sort the DataFrame by Marks in descending order?
df.sort_values(by="Marks", ascending=False)

      Name  Subject  Marks
4      Bob  Science     95
1      Bob     Math     90
3    Alice  Science     88
0    Alice     Math     85
2  Charlie  Science     78

In [86]:
#How do you sort by Subject first and then by Marks?
df.sort_values(by=["Subject", "Marks"])

      Name  Subject  Marks
0    Alice     Math     85
1      Bob     Math     90
2  Charlie  Science     78
3    Alice  Science     88
4      Bob  Science     95

In [88]:
#How do you find the average marks for each subject?
df.groupby("Subject")["Marks"].mean()

Subject
Math       87.5
Science    87.0
Name: Marks, dtype: float64

In [90]:
#How do you count number of students per subject?
df.groupby("Subject")["Name"].count()

Subject
Math       2
Science    3
Name: Name, dtype: int64

In [92]:
#How do you add a column Result (Pass if Marks ≥ 80 else Fail)?
df["Result"] = df["Marks"].apply(lambda x: "Pass" if x >= 80 else "Fail")
#apply() runs logic on each value in the column and creates a new column.

In [96]:
#How do you add a column that gives 5 bonus marks to everyone?
df["Bonus_Marks"] = df["Marks"] + 5
#Pandas supports vectorized operations, so the addition applies to all rows at once.

In [100]:
#How do you identify duplicate student names?
df[df.duplicated("Name")]

    Name  Subject  Marks Result  Bonus_Marks
3  Alice  Science     88   Pass           93
4    Bob  Science     95   Pass          100

In [102]:
#How do you remove duplicate names but keep the first occurrence?
df.drop_duplicates(subset="Name")

      Name  Subject  Marks Result  Bonus_Marks
0    Alice     Math     85   Pass           90
1      Bob     Math     90   Pass           95
2  Charlie  Science     78   Fail           83

In [106]:
#How do you rename the column "Marks" to "Score"?
df.rename(columns={"Marks": "Score"})

      Name  Subject  Score Result  Bonus_Marks
0    Alice     Math     85   Pass           90
1      Bob     Math     90   Pass           95
2  Charlie  Science     78   Fail           83
3    Alice  Science     88   Pass           93
4      Bob  Science     95   Pass          100

In [108]:
#How do you select only Name and Marks columns?
df[["Name", "Marks"]]

      Name  Marks
0    Alice     85
1      Bob     90
2  Charlie     78
3    Alice     88
4      Bob     95

In [110]:
#How do you label students as "Topper" if Marks ≥ 90?
df["Category"] = df["Marks"].apply(
    lambda x: "Topper" if x >= 90 else "Regular"
)

In [116]:
#How do you increase Marks by 10% only for Science students?
df.loc[df["Subject"] == "Science", "Marks"] *= 1.10

In [118]:
#How do you find maximum and minimum marks?
df["Marks"].max(), df["Marks"].min()

(126.44500000000005, 85.0)

In [120]:
#How do you find the overall average marks?
df["Marks"].mean()

104.47820000000002

In [122]:
#How do you find average marks of students who passed (Marks ≥ 80)?
df[df["Marks"] >= 80]["Marks"].mean()
#First filters passing students, then computes average.

104.47820000000002